# GetHashCode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..GetHashCode Method
IFCData Class See Also
---
Gets the hash code.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace